'''
Обидва варіанти алгоритму DFS починають з початкової вершини, відвідують її, а потім переходять до її сусідніх вершин. Рекурсивний варіант використовує системний стек для зберігання стану рекурсивних викликів, тоді як ітеративний варіант використовує явний стек для зберігання вершин. В обох випадках ми продовжуємо відвідувати сусідні вершини, поки не дійдемо до вершини, усі сусіди якої вже відвідані, після чого повертаємося назад і продовжуємо процес, доки всі вершини не будуть відвідані.
'''



def dfs_iterative(graph, start_vertex):
    visited = set()
    # Використовуємо стек для зберігання вершин
    stack = [start_vertex]  
    while stack:
        # Вилучаємо вершину зі стеку
        vertex = stack.pop()  
        if vertex not in visited:
            print(vertex, end=' ')
            # Відвідуємо вершину
            visited.add(vertex)
            # Додаємо сусідні вершини до стеку
            stack.extend(reversed(graph[vertex]))  

# Представлення графа за допомогою списку суміжності
graph = {
    'A': ['B', 'C'],
    'B': ['A', 'D', 'E'],
    'C': ['A', 'F'],
    'D': ['B'],
    'E': ['B', 'F'],
    'F': ['C', 'E']
}

# Виклик функції DFS
dfs_iterative(graph, 'A')
